Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: When this build step is run nothing is printed to the console. This is because the `HelloRecorder` that is injected is actually a proxy that records all invocations. Instead, if we run the resulting Quarkus program we will see 'Hello World' printed to the console.
ja_jp: このビルドステップを実行しても、コンソールには何も表示されません。これは、注入された `HelloRecorder` が、実際にはすべての呼び出しを記録するプロキシであるためです。代わりに、生成されたQuarkusプログラムを実行すると、コンソールに「Hello World」が出力されます。

source: When this extension is active, any GraphQL client configured through properties, rather than programmatically by the builder, uses the OIDC client to acquire an access token, which it then sets as the `Authorization` header value. The OIDC client also refreshes expired access tokens.
ja_jp: このエクステンションがアクティブな場合、ビルダーによってプログラム的にではなくプロパティーを通じて設定された GraphQL クライアントは、OIDC クライアントを使用してアクセストークンを取得し、それを `Authorization` ヘッダー値として設定します。OIDC クライアントは期限切れのアクセストークンも更新します。

source: When to accept all origins
ja_jp: すべてのオリジンを受け入れる場合

source: When to subscribe to a `Uni` or `Multi`
ja_jp: `Uni` または `Multi` をサブスクライブするタイミング

source: When to use Docker vs Podman extension
ja_jp: DockerとPodmanエクステンションの使い分け

source: When topics/partitions are assigned or revoked from a consumer, it pauses the message delivery and resumes once the rebalance completes.
ja_jp: トピック/パーティションがコンシューマーから割り当てられるか取り消されると、メッセージの配信が一時停止され、リバランスが完了すると再開されます。

source: When trace output is configured, no native image configuration is generated, and instead a `target/native-image-agent-trace-file.json` file is generated that contains trace information. For example:
ja_jp: トレース出力が設定されている場合、ネイティブイメージ設定は生成されません。 代わりに、トレース情報を含む `target/native-image-agent-trace-file.json` ファイルが生成されます。 たとえば:

source: When trying to rebuild the application, you’ll encounter an error:
ja_jp: アプリケーションを再ビルドしようとすると、エラーが発生します。

source: When updating extension configuration:
ja_jp: エクステンションの設定を更新する場合:

source: When used with Jackson to perform JSON serialization, Quarkus REST provides the ability to limit the set of fields that are serialized based on the roles of the current user. This is achieved by simply annotating the fields (or getters) of the POJO being returned with `@io.quarkus.resteasy.reactive.jackson.SecureField`.
ja_jp: JSON をシリアライズするために Jackson を使用する場合、Quarkus REST は、現在のユーザのroleに基づいてシリアライズされるフィールドのセットを制限する機能を提供します。これは、返されるPOJOのフィールド（またはゲッター）を `@io.quarkus.resteasy.reactive.jackson.SecureField` でアノテーションするだけで実現できます。

source: When used with Jackson to perform JSON serialization, RESTEasy Reactive provides the ability to limit the set of fields that are serialized based on the roles of the current user. This is achieved by simply annotating the fields (or getters) of the POJO being returned with `@io.quarkus.resteasy.reactive.jackson.SecureField`.
ja_jp: JSON をシリアライズするために Jackson を使用する場合、RESTEasy Reactive は、現在のユーザのroleに基づいてシリアライズされるフィールドのセットを制限する機能を提供します。これは、返されるPOJOのフィールド（またはゲッター）を `@io.quarkus.resteasy.reactive.jackson.SecureField` でアノテーションするだけで実現できます。

source: When used, the key is _watched_ and the _SET_ command is executed in a transaction (`MULTI/EXEC`).
ja_jp: 使用すると、キーが _ウォッチ_ され、トランザクション（ `MULTI/EXEC` ）で _SET_ コマンドが実行されます。

source: When using <<rest_integration,`quarkus-rest-qute`>> (or `quarkus-resteasy-qute`) the `locale` attribute is derived from the `Accept-Language` header if not set by a user.
ja_jp: <<rest_integration,`quarkus-rest-qute`>> を使用する場合にユーザーが `locale` 属性を設定していなければ、それは `Accept-Language` ヘッダーから導出されます。

source: When using <<resteasy_integration,quarkus-resteasy-qute>> the `locale` attribute is derived from the `Accept-Language` header if not set by a user.
ja_jp: <<resteasy_integration,quarkus-resteasy-qute>> を使用する場合、 `locale` 属性は、ユーザが設定していない場合は `Accept-Language` ヘッダから派生します。

source: When using <<resteasy_integration,quarkus-resteasy-qute>> the `locale` attribute is derived from the the `Accept-Language` header if not set by a user.
ja_jp: <<resteasy_integration,quarkus-resteasy-qute>> を使用する場合、 `locale` 属性は、ユーザが設定していない場合は `Accept-Language` ヘッダから派生します。

source: When using Dev Services the default datasource will always be created, but to specify a named datasource you need to have at least one build time property so Quarkus knows to create the datasource. In general you will usually either specify the `db-kind` property, or explicitly enable DevDb: `quarkus.datasource."name".devservices.enabled=true`.
ja_jp: DevServicesを使用する場合、デフォルトのデータソースは常に作成されますが、名前付きのデータソースを指定するには、Quarkusがデータソースの作成を認識できるように、少なくとも1つのビルド時プロパティが必要です。一般的には、 `db-kind` プロパティを指定するか、明示的にDevDb: `quarkus.datasource."named".devservices=true` を有効にします。

source: When using Dev Services the default datasource will always be created, but to specify a named datasource you need to have at least one build time property so Quarkus knows to create the datasource. You will usually either specify the `db-kind` property, or explicitly enable Dev Services: `quarkus.datasource."name".devservices.enabled=true`.
ja_jp: DevServicesを使用する場合、デフォルトのデータソースは常に作成されますが、名前付きのデータソースを指定するには、Quarkusがデータソースの作成を認識できるように、少なくとも1つのビルド時プロパティが必要です。通常は `db-kind` プロパティを指定するか、明示的に `quarkus.datasource."name".devservices.enabled=true` を指定してDevServicesを有効にします。

source: When using Dev Services with Hibernate ORM, by default Quarkus will wipe out the database on application startup, which will wipe out the database data on your Docker host's filesystem. Configure `quarkus.hibernate-orm.database.generation=none` or `quarkus.hibernate-orm.database.generation=validate` to avoid this behavior.
ja_jp: Hibernate ORMでDev Servicesを使用する場合、デフォルトではQuarkusはアプリケーション起動時にデータベースを消去し、Dockerホストのファイルシステム上のデータベースデータが消去されます。この動作を回避するには、 `quarkus.hibernate-orm.database.generation=none` または `quarkus.hibernate-orm.database.generation=validate` を構成してください。

source: When using Dev Services with Hibernate ORM, by default Quarkus will wipe out the database on application startup, which will wipe out the database data on your Docker host's filesystem. Configure `quarkus.hibernate-orm.schema-management.strategy=none` or `quarkus.hibernate-orm.schema-management.strategy=validate` to avoid this behavior.
ja_jp: Hibernate ORM で Dev Services を使用する場合、デフォルトでは Quarkus はアプリケーション起動時にデータベースを消去します。これにより、Docker ホストのファイルシステム上のデータベースデータも消去されます。この動作を回避するには、`quarkus.hibernate-orm.schema-management.strategy=none` または `quarkus.hibernate-orm.schema-management.strategy=validate` を設定してください。

source: When using Dev Services, the default datasource will always be created, but to specify a named datasource, you need to have at least one build time property so Quarkus can detect how to create the datasource.
ja_jp: Dev Servicesを使用すると、デフォルトのデータソースが常に作成されますが、名前付きデータソースを指定するには、Quarkusがデータソースの作成方法を検出できるように、少なくとも1つのビルド時プロパティが必要です。

source: When using Flyway together with Hibernate ORM, you can use the Dev UI to generate the initial schema creation script.
ja_jp: FlywayをHibernate ORMと一緒に使用する場合、Dev UIを使用して初期スキーマ作成スクリプトを生成できます。

source: When using HTTP Basic Auth, the `@io.quarkus.rest.client.reactive.ClientBasicAuth` annotation provides a much simpler way of configuring the necessary `Authorization` header.
ja_jp: HTTP Basic Auth を使用する場合、 `@io.quarkus.rest.client.reactive.ClientBasicAuth` アノテーションを使用すると、 必要な `Authorization` ヘッダーの設定が大幅に簡素化されます。

source: When using Hibernate ORM in Quarkus, you don't need to have a `persistence.xml` resource to configure it.
ja_jp: QuarkusでHibernate ORMを使用する場合は、 設定の為に `persistence.xml` リソースは必要ありません。

source: When using Hibernate Reactive in Quarkus, you need to:
ja_jp: QuarkusでHibernate Reactiveを使用する場合、以下が必要です:

source: When using Infinispan as the backend for Quarkus cache, each cached item will be stored in Infinispan:
ja_jp: Quarkus キャッシュのバックエンドとして Infinispan を使用する場合、キャッシュされた各アイテムは Infinispan に保存されます。

source: When using JsonRPC, pass in the provided namespace (instead of `this`, as in normal components).
ja_jp: JsonRPC を使用する場合は、(通常のコンポーネントのように `this` ではなく) 提供された名前空間を渡します。

source: When using Kotlin data classes with `native-image` you may experience serialization errors that do not occur with the `JVM` version, despite the Kotlin Jackson Module being registered. This is especially so if you have a more complex JSON hierarchy, where an issue on a lower node causes a serialization failure. The error message displayed is a catch-all and typically displays an issue with the root object, which may not necessarily be the case.
ja_jp: Kotlin のデータクラスを `native-image` で使用すると、Kotlin Jackson Module が登録されているにもかかわらず、 `JVM` バージョンでは発生しないシリアライズエラーが発生することがあります。これは、より複雑なJSON階層を持っている場合に特に見られる現象で、下位のノードで問題が発生するとシリアライズに失敗します。表示されるエラーメッセージはキャッチオールで、通常はルートオブジェクトの問題を表示しますが、必ずしもそうではない場合もあります。

source: When using Kotlin with Quarkus REST, it is worth considering the use of `quarkus-rest-kotlin-serialization` which leverages the Kotlin Serialization framework instead of Jackson.
ja_jp: Quarkus RESTでKotlinを使用する場合、Jacksonの代わりにKotlin Serializationフレームワークを活用する `quarkus-rest-kotlin-serialization` を使用することは考慮に値します。

source: When using Kotlin, if default methods are going to be leveraged, then the Kotlin compiler needs to be configured to use Java's default interface capabilities. See link:https://kotlinlang.org/docs/java-to-kotlin-interop.html#default-methods-in-interfaces[this] for more details.
ja_jp: Kotlin を使用するときにデフォルトのメソッドを利用する場合は、Java のデフォルトのインターフェイス機能を使用するように Kotlin コンパイラーを設定する必要があります。 詳細は、link:https://kotlinlang.org/docs/java-to-kotlin-interop.html#default-methods-in-interfaces[こちら] を参照してください。

source: When using Kubernetes, it is recommended to set the client id and secret in a Kubernetes secret:
ja_jp: Kubernetes を使用する場合は、クライアント ID とシークレットを Kubernetes シークレットに設定することをお勧めします。

source: When using Leyden, you can reach a point where no classes are loaded at startup at all.
ja_jp: Leyden を使用すると、起動時にクラスがまったくロードされないというレベルにまで到達できます。

source: When using Maven, we could use the following configuration:
ja_jp: Maven を使用する場合は、以下のような構成にすることができます。

source: When using Mutiny, alternative "xAndAwait" methods are provided to be used with virtual threads. They ensure that waiting for the completion of the I/O will not "pin" the carrier thread and deteriorate performance. Pinning is a phenomenon that we describe in xref:Pinning cases[this section].
ja_jp: Mutinyを使用する場合は仮想スレッドで使用するための代替の"xAndAwait"メソッドが提供されます。これらは、I/Oの完了を待っても、キャリアスレッドを"拘束"して性能を悪化させないようにするものです。拘束とは、 xref:拘束の場合[このセクション] で説明する現象です。

source: When using PEM keystore, the following formats are supported:
ja_jp: PEM キーストアを使用する場合、次のフォーマットがサポートされます。

source: When using Panache, things are simple:
ja_jp: Panacheの使い方は簡単です:

source: When using Quarkus Dev Mode just invoke HTTP requests on `http://localhost:8080` as you normally would when testing your REST endpoints. This request will hit the Mock Event Server and will be converted to the API Gateway json message that is consumed by the Quarkus Lambda Poll loop.
ja_jp: Quarkus Dev Mode を使用する場合は、REST エンドポイントをテストする場合と同じように、 `http://localhost:8080` で HTTP リクエストを呼び出すだけです。このリクエストは Mock Event Server にヒットし、Quarkus Lambda Poll ループによって消費される API Gateway json メッセージに変換されます。

source: When using Quarkus Messaging Pulsar (`io.quarkus:quarkus-messaging-pulsar`), Quarkus can often automatically detect the correct Pulsar Schema to configure. This autodetection is based on declarations of `@Incoming` and `@Outgoing` methods, as well as injected ``@Channel``s.
ja_jp: Quarkus Messaging Pulsar (`io.quarkus:quarkus-messaging-pulsar`) を使用すると、Quarkus は多くの場合、設定する正しい Pulsar Schema を自動的に検出できます。 この自動検出は、 `@Incoming` メソッドと `@Outgoing` メソッドの宣言、および注入された ``@Channel`` に基づいています。

source: When using Quarkus Messaging with Kafka (`io.quarkus:quarkus-messaging-kafka`), Quarkus can often automatically detect the correct serializer and deserializer class. This autodetection is based on declarations of `@Incoming` and `@Outgoing` methods, as well as injected ``@Channel``s.
ja_jp: Quarkus Messaging を Kafka (`io.quarkus:quarkus-messaging-kafka`) と併用する場合、Quarkus は多くの場合、正しいシリアライザーとデシリアライザーのクラスを自動的に検出できます。 この自動検出は、 `@Incoming` メソッドと `@Outgoing` メソッドの宣言、および注入された ``@Channel`` に基づいています。

source: When using REST Assured in your test, the connection and response timeouts are set to 30 seconds. You can override this setting with the `quarkus.http.test-timeout` property:
ja_jp: テストで REST Assured を使用する場合、接続と応答のタイムアウトは 30 秒に設定されます。 この設定は `quarkus.http.test-timeout` プロパティーでオーバーライドできます:

source: When using Reactive Messaging and the Kafka connector, each configured channel (incoming or outgoing) provides _startup_, _liveness_ and _readiness_ checks.
ja_jp: Reactive Messaging と Kafka コネクターを使用する場合、設定済みの各チャンネル（着信または送信）は、_startup_、_liveness_、および _readiness_ チェックを提供します。

source: When using Reactive Messaging and the Kafka connector, you entered an asynchronous world.
ja_jp: Reactive Messaging と Kafka コネクタを使用すると、非同期の世界に入りました。

source: When using Redis as the backend for Quarkus cache, each cached item will be stored in Redis:
ja_jp: QuarkusキャッシュのバックエンドとしてRedisを使用する場合、各キャッシュアイテムはRedisに保存されます:

source: When using Redis in cluster mode, you need to pass multiple _host urls_, configure the client type to `cluster` and configure the `replicas` mode:
ja_jp: Redis をクラスターモードで使用する場合、複数の _ホスト urls_ を渡し、クライアントのタイプを `cluster` に設定し、 `replicas` モードを設定する必要があります。

source: When using Repositories, you can get the exact same convenient methods as wit the active record pattern, injected in your Repository, by making them implements `PanacheMongoRepository`:
ja_jp: リポジトリを使用する場合、 `PanacheMongoRepository` を実装することでリポジトリに注入されたアクティブレコードパターンのウィットと全く同じ便利なメソッドが得られます。

source: When using Repositories, you can get the exact same convenient methods as with the active record pattern, injected in your Repository, by making them implements `PanacheMongoRepository`:
ja_jp: Repositories を使用する場合、それらが `PanacheMongoRepository` を実装するようにし、Repository に注入することで、アクティブレコードパターンと全く同じ便利なメソッドを取得することができます。

source: When using Repositories, you get the exact same convenient methods as with the active record pattern, injected in your Repository, by making them implement `PanacheMongoRepository`:
ja_jp: リポジトリを使用する場合、 `PanacheMongoRepository` を実装させることで、アクティブレコードパターンとまったく同じ便利なメソッドをリポジトリに注入することができます。

source: When using Repositories, you get the exact same convenient methods as with the active record pattern, injected in your Repository, by making them implement `PanacheRepository`:
ja_jp: リポジトリを使用する場合、 `PanacheRepository` を実装することでアクティブレコードパターンをリポジトリに注入した場合と全く同じ便利なメソッドを得ることができます。

source: When using Repositories, you get the exact same convenient methods as with the active record pattern, injected in your Repository, by making them implements `PanacheRepository`:
ja_jp: リポジトリを使用する場合、 `PanacheRepository` を実装することでアクティブレコードパターンとまったく同じ便利なメソッドをリポジトリにインジェクションできます:

source: When using Security along with RESTEasy Reactive and Jackson, Quarkus can limit the fields that are included in JSON serialization based on the configured security. See the xref:resteasy-reactive.adoc#secure-serialization[RESTEasy Reactive documentation] for details.
ja_jp: RESTEasy Reactive および Jackson とともにセキュリティーを使用する場合、Quarkus は、設定されたセキュリティーに基づいて、JSON シリアル化に含まれるフィールドを制限できます。詳細は、xref:resteasy-reactive.adoc#secure-serialization[RESTEasy Reactive documentation] を参照してください。

source: When using Sentinel, you need to pass multiple _host urls_ and configure the client type to `sentinel`:
ja_jp: Sentinel を使用する場合、複数の _ホスト urls_ を渡し、クライアントのタイプを `sentinel` に設定する必要があります。

source: When using SmallRye Reactive Messaging with Kafka (`io.quarkus:quarkus-smallrye-reactive-messaging-kafka`), Quarkus can often automatically detect the correct serializer and deserializer class. This autodetection is based on declarations of `@Incoming` and `@Outgoing` methods, as well as injected ``@Channel``s.
ja_jp: SmallRye Reactive Messaging で Kafka (`io.quarkus:quarkus-smallrye-reactive-messaging-kafka`) を使用するときに、Quarkus は多くの場合、正しいシリアライザーとデシリアライザーのクラスを自動的に検出することができます。この自動検出は、 `@Incoming` メソッドと `@Outgoing` メソッドの宣言、および注入された ``@Channel`` に基づいています。

source: When using Uni, having to write `onItem()` can be cumbersome. Fortunately, Mutiny provides a set of shortcut to make your code more concise:
ja_jp: Uniを使うとき、 `onItem()` を書かなければならないのは面倒なことです。幸いなことに、Mutinyにはコードをより簡潔にするための一連のショートカットが用意されています。

source: When using `@ApplicationScoped`, you will get a single instance for your verticle. Having multiple instances of verticles can be helpful to share the load among them. Each of them will be associated with a different I/O thread (Vert.x event loop).
ja_jp: `@ApplicationScoped` を使用する場合、Verticleのインスタンスは1つになります。複数のVerticleのインスタンスを持つことは、それらの間で負荷を共有するのに役立ちます。各々のインスタンスは、異なるI/Oスレッド（Vert.xイベントループ）に関連付けられます。

source: When using `@Blocking`, it ignores the value of the `blocking` attribute of `@ConsumeEvent`.
ja_jp: `@Blocking` を使用する場合、 `@ConsumeEvent` の `blocking` 属性の値は無視されます。

source: When using `@Blocking`, it ignores the value of the `blocking` attribute of `@ConsumeEvent`. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic.
ja_jp: `@Blocking` を使用する場合は、 `@ConsumeEvent` の `blocking` 属性の値は無視されます。このトピックの詳細については、 xref:quarkus-reactive-architecture.adoc[Quarkus リアクティブアーキテクチャのドキュメント] を参照してください。

source: When using `@ConfigProperties` on a class or an interface, if the value of one of its fields is not provided, the application startup will fail, and a `javax.enterprise.inject.spi.DeploymentException` will be thrown. This does not apply to `Optional` fields and fields with a default value.
ja_jp: クラスやインターフェイスで `@ConfigProperties` を使用する場合、そのフィールドの 1 つの値が提供されていないと、アプリケーションの起動に失敗し、 `javax.enterprise.inject.spi.DeploymentException` がスローされます。これは、 `Optional` フィールドとデフォルト値を持つフィールドには適用されません。

source: When using `@RedisClientName`, you can omit the `@Inject` annotation.
ja_jp: `@RedisClientName` を使用する場合は、 `@Inject` アノテーションを省略することができます。

source: When using `DeploymentConfig` and xref:deploying-to-kubernetes.adoc#service_binding[Service Binding], re-deploying might remove the configuration added by OpenShift to allow service discovery. A new container image build will trigger a refresh of the Quarkus app in OpenShift: `-Dquarkus.container-image.build=true` which might be enough in most situations. If you need to update the OpenShift resources, you need to delete the binding first to create it again after new deployment.
ja_jp: `DeploymentConfig` と xref:deploying-to-kubernetes.adoc#service_binding[Service Binding] を使用している場合、再デプロイすると、OpenShift によって追加された設定が削除され、サービスディスカバリーができなくなる可能性があります。新しいコンテナイメージのビルドは、OpenShiftのQuarkusアプリの更新をトリガーします: `-Dquarkus.container-image.build=true` 、ほとんどの状況ではこれで十分かもしれません。OpenShiftリソースを更新する必要がある場合は、まずバインディングを削除し、新しいデプロイ後に再度作成する必要があります。

source: When using `Key_Shared` consumer subscriptions, the `batcherBuilder` can be configured to `BatcherBuilder.KEY_BASED`.
ja_jp: `Key_Shared` コンシューマーサブスクリプションを使用する場合、 `batcherBuilder` を `BatcherBuilder.KEY_BASED` に設定できます。

source: When using `ObjectId`, MongoDB will automatically provide a value for you, but if you use a custom field type, you need to provide the value by yourself.
ja_jp: `ObjectId` を使う場合は、MongoDB が自動的に値を提供してくれますが、カスタムフィールド型を使う場合は、自分で値を提供する必要があります。

source: When using `TemplateInstance#computedData(String, Function<String, Object>)` a mapping function is associated with a specific key and this function is used each time a value for the given key is requested. In case of global variables, a static method is called or a static field is read in the mapping function.
ja_jp: `TemplateInstance#computedData(String, Function<String, Object>)` を使用している場合、 マッピング関数は特定のキーに関連付けられ、指定されたキーの値が要求されるたびに、この関数が使用されます。グローバル変数の場合は、静的メソッドが呼び出されるか、マッピング関数で静的フィールドが読み取られます。

source: When using `mongo+srv://` URLs, the MongoDB driver resolves DNS SRV records to retrieve the list of hosts to connect to. By default, it relies on a DNS client implemented using JNDI.
ja_jp: `mongo+srv://` URL を使う場合、MongoDB ドライバは DNS SRV レコードを解決して接続するホストの一覧を取得します。デフォルトでは、JNDI を使って実装された DNS クライアントに依存します。

source: When using `protobuf-maven-plugin`, instead of the `quarkus-maven-plugin`, every time you update the `proto` files, you need to re-generate the classes (using `mvn compile`).
ja_jp: `quarkus-maven-plugin` の代わりに `protobuf-maven-plugin` を利用する場合、 `proto` ファイルを更新するたびに、( `mvn compile` を使用して) クラスを再生成する必要があります。

source: When using `protobuf-maven-plugin`, instead of the `quarkus-maven-plugin`, you need to re-generate classes (using `mvn compile`) every time you update the `proto` files.
ja_jp: `quarkus-maven-plugin` の代わりに `protobuf-maven-plugin` を使用する場合は、 `proto` ファイルを更新するたびに (`mvn compile` を使用して) クラスを再生成する必要があります。

source: When using `quarkus-container-image-jib`, `quarkus-container-image-docker`, or `quarkus-container-image-podman`:
ja_jp: `quarkus-container-image-jib` 、 `quarkus-container-image-docker` 、または `quarkus-container-image-podman` を使用する場合。

source: When using `quarkus-rest-client-reactive` however, users must use `quarkus-keycloak-admin-client-reactive` to access the same functionality and use the reactive REST Client.
ja_jp: 一方、 `quarkus-rest-client-reactive` を使用する場合、ユーザーは同じ機能にアクセスするために `quarkus-keycloak-admin-client-reactive` を使用し、reactive REST Client を使用する必要があります。

source: When using `quarkus-rest-client-reactive` however, users must use `quarkus-oidc-client-filter-reactive` to access the same functionality.
ja_jp: 一方、 `quarkus-rest-client-reactive` を使用する場合、同じ機能を利用するためには、 `quarkus-oidc-client-filter-reactive` を使用する必要があります。

source: When using `quarkus-rest-client-reactive` however, users must use `quarkus-oidc-token-propagation-reactive` to access the same functionality.
ja_jp: 一方、 `quarkus-rest-client-reactive` を使用する場合、同じ機能を利用するためには、 `quarkus-oidc-token-propagation-reactive` を使用する必要があります。

source: When using `quarkus-rest-client`, users can use the `quarkus-keycloak-admin-client` to administer the target Keycloak instance by leveraging the rest client.
ja_jp: `quarkus-rest-client` を使用する場合、ユーザーは `quarkus-keycloak-admin-client` を使用して、RESTクライアントを活用してターゲットのKeycloakインスタンスを管理することができます。

source: When using `quarkus-rest-client`, users can use the `quarkus-keycloak-admin-rest-client` to administer the target Keycloak instance by leveraging the rest client.
ja_jp: `quarkus-rest-client` を使用する場合、ユーザーは `quarkus-keycloak-admin-rest-client` を使用して、 RESTクライアントを活用してターゲットの Keycloakインスタンスを管理できます。

source: When using `quarkus-rest-client`, users can use the `quarkus-oidc-client-filter` extensions to acquire and refresh access tokens from OpenID Connect and OAuth 2.0 compliant Authorization Servers.
ja_jp: `quarkus-rest-client` を使用する場合、ユーザーは `quarkus-oidc-client-filter` エクステンションを使用して、OpenID Connect および OAuth 2.0 準拠の Authorization Server からアクセストークンを取得し、更新することができます。

source: When using `quarkus-rest-client`, users can use the `quarkus-rest-client-oidc-filter` extension to acquire and refresh access tokens from OpenID Connect and OAuth 2.0 compliant Authorization Servers.
ja_jp: `quarkus-rest-client` を使用する場合、ユーザーは `quarkus-rest-client-oidc-filter` エクステンションを使用して、OpenID Connect および OAuth 2.0 準拠の認可サーバーからアクセストークンを取得および更新できます。

source: When using `quarkus-rest-qute` or `quarkus-resteasy-qute` the content negotiation is performed automatically. For more information, see the <<rest_integration>> section.
ja_jp: `quarkus-rest-qute` または `quarkus-resteasy-qute` を使用すると、コンテンツネゴシエーションが自動的に実行されます。 詳細は、<<rest_integration>> セクションを参照してください。

source: When using `quarkus-resteasy-client` however, users must use `quarkus-keycloak-admin-resteasy-client` to access the same functionality and use the legacy RESTEasy Classic-based REST Client.
ja_jp: ただし、 `quarkus-resteasy-client` を使用する場合、ユーザーは同じ機能にアクセスするために `quarkus-keycloak-admin-resteasy-client` を使用する必要があります。 従来の RESTEasy Classic ベースの REST クライアントを使用します。
